tutorials/multiform/resolvedSimulations/reactivePacking3D1cell/constant/data
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

Dfluid       1e-4;
K            -1.01e-3;
Kd           -1e-3;
shear        false;
Sinit        1;
Cinit        1;
S0           1.01;
forward      saturatingPowerLaw;
backward     constant;
Kshear       0;
// ************************************************************************* //
