tutorials/multiform/resolvedSimulations/reactivePacking3D1cell/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.2.2                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

x1 0;
y1 0;
z1 0;
x2 1;
y2 0.5;
z2 0.5;
xgrid 100;
ygrid 50;
zgrid 50;

convertToMeters 1.408205;

vertices
(
    ($x1 $y1 $z1)
    ($x2 $y1 $z1)
    ($x2 $y2 $z1)
    ($x1 $y2 $z1)
    ($x1 $y1 $z2)
    ($x2 $y1 $z2)
    ($x2 $y2 $z2)
    ($x1 $y2 $z2)
);

blocks
(
    hex (0 1 2 3 4 5 6 7) ($xgrid $ygrid $zgrid) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    symmup
    {
        type symmetryPlane;
        faces
        (
            (3 7 6 2)
        );
    }

    inlet
    {
        type cyclic;
        neighbourPatch outlet;
        faces
        (
            (0 4 7 3)
        );
    }

    outlet
    {
        type cyclic;
        neighbourPatch inlet;
        faces
        (
            (2 6 5 1)
        );
    }

    symmdown
    {
        type symmetryPlane;
        faces
	(
            (1 5 4 0)
        );
    }

    frontAndBack
    {
        type        symmetry;
        faces
        (
            (0 3 2 1)
            (4 5 6 7)
        );
    }


);

mergePatchPairs
(
);

// ************************************************************************* //
