tutorials/multiform/resolvedSimulations/reactivePacking3D1cell/system/domainsize
scalegrid 1.408205;
x1 0.000000;
y1 0.000000;
z1 0.000000;
xin 0.500000;
yin 0.010000;
zin 0.000000;
x2 10.000000;
y2 1.000000;
z2 1.000000;
xgrid 970;
ygrid 97;
zgrid 97;
snap true;
#inputMode merge